import {Pipe, PipeTransform} from '@angular/core';

@Pipe({
  name: 'nepaliWord'
})
export class NepaliWordPipe implements PipeTransform {
  mapPretti = new Map([
    [1, 's'], // क
    [2, 'v'], // ख
    [3, 'u'], // ग
    [4, '3'], // घ
    [5, 'ª'], // ङ
    [6, 'r'], // च
    [7, '5'], // छ
    [8, 'h'], // ज
    [9, 'em'], // झ
    [10, '`'], // ञ
    [11, '6'], // ट
    [12, '7'], // ठ
    [13, '8'], // ड
    [14, '9'], // ढ
    [15, '0f'], // ण
    [16, 't'], // त
    [17, 'y'], // थ
    [18, 'b'], // द
    [19, 'w'], // ध
    [20, 'g'], // न
    [21, 'k'], // प
    [22, 'km'], // फ
    [23, 'a'], // ब
    [24, 'e'], // भ
    [25, 'd'], // म
    [26, 'o'], // य
    [27, '/'], // र
    [28, 'n'], // ल
    [29, 'j'], // व
    [30, 'z'], // श
    [31, 'if'], // ष
    [32, ';'], // स
    [33, 'x'], // ह
    [34, 'If'], // क्ष
    [35, 'q'], // त्र
    [36, '1'] // ज्ञ
  ]);

  mapUnicode = new Map([
    [1, 'क'], // क
    [2, 'ख'], // ख
    [3, 'ग'], // ग
    [4, 'घ'], // घ
    [5, 'ङ'], // ङ
    [6, 'च'], // च
    [7, 'छ'], // छ
    [8, 'ज'], // ज
    [9, 'झ'], // झ
    [10, 'ञ'], // ञ
    [11, 'ट'], // ट
    [12, 'ठ'], // ठ
    [13, 'ड'], // ड
    [14, 'ढ'], // ढ
    [15, 'ण'], // ण
    [16, 'त'], // त
    [17, 'थ'], // थ
    [18, 'द'], // द
    [19, 'ध'], // ध
    [20, 'न'], // न
    [21, 'प'], // प
    [22, 'फ'], // फ
    [23, 'ब'], // ब
    [24, 'भ'], // भ
    [25, 'म'], // म
    [26, 'य'], // य
    [27, 'र'], // र
    [28, 'ल'], // ल
    [29, 'व'], // व
    [30, 'श'], // श
    [31, 'ष'], // ष
    [32, 'स'], // स
    [33, 'ह'], // ह
    [34, 'क्ष'], // क्ष
    [35, 'त्र'], // त्र
    [36, 'ज्ञ'] // ज्ञ
  ]);

  transform(value: number, mapType: string = 'unicode'): string {
    if (mapType === 'unicode') {
      return this.mapUnicode.get(value);
    } else if (mapType === 'pretti') {
      return this.mapPretti.get(value);
    } else {
      return null;
    }
  }

}
